OpenFOAM-13/tutorials/incompressibleVoF/weirOverflow/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultValues
{
    alpha.water 0;
}

zones
{
    water
    {
        type        box;
        zoneType    cell;

        box         (-100 0 -100) (0 20 100);

        values
        {
            alpha.water 1;
        }
    }

    patchFaces
    {
        type        box;
        zoneType    face;

        box         (-100 0 -100) (0 20 100);

        zone
        {
            type        patch;
            patch       inlet;
        }

        values
        {
            alpha.water 1;
        }
    }
}

// ************************************************************************* //
